app/controllers/categories_controller.rb

  def index
    @categories = Category.where(author_id: current_user.id)
    @category_totals = {}
    @categories.each do |category|
      category_transactions = category.transactions_list.order(created_at: :desc)
      total_amount = category_transactions.sum(:amount)
---
SELECT "categories".* FROM "categories" WHERE "categories"."author_id" = $1  [["author_id", 5]]
SELECT "categories".* FROM "categories" WHERE "categories"."author_id" = $1  [["author_id", 1]]
SELECT SUM("transactions"."amount") FROM "transactions" INNER JOIN "categories_transactions" ON "transactions"."id" = "categories_transactions"."transaction_id" WHERE "categories_transactions"."category_id" = $1  [["category_id", 1]]

  def show
    @category = Category.find(params[:id])
    @category_transactions = @category.transactions_list.order(created_at: :desc)
    @total_amount = @category_transactions.sum(:amount)
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "transactions".* FROM "transactions" INNER JOIN "categories_transactions" ON "transactions"."id" = "categories_transactions"."transaction_id" WHERE "categories_transactions"."category_id" = $1 ORDER BY "transactions"."created_at" DESC  [["category_id", 1]]
SELECT "transactions".* FROM "transactions" INNER JOIN "categories_transactions" ON "transactions"."id" = "categories_transactions"."transaction_id" WHERE "categories_transactions"."category_id" = $1 ORDER BY desc  [["category_id", 1]]
SELECT SUM("transactions"."amount") FROM "transactions" INNER JOIN "categories_transactions" ON "transactions"."id" = "categories_transactions"."transaction_id" WHERE "categories_transactions"."category_id" = $1  [["category_id", 1]]

  def create
    @category = Category.where(author_id: current_user.id).build(category_params)
    if @category.save
---
INSERT INTO "categories" ("name", "icon", "author_id", "created_at", "updated_at", "details") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"