app/controllers/transactions_controller.rb

  def create
    @transaction = Transaction.new(transaction_params)
    @transaction.author = current_user

    respond_to do |format|
      if @transaction.save
        format.html { redirect_to category_path(@transaction.categories.first), notice: 'Transaction created successfully.' }
---
INSERT INTO "transactions" ("name", "amount", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Gucci_belt"], ["amount", "1223.0"], ["author_id", 1], ["created_at", "2023-07-05 13:46:47.379929"], ["updated_at", "2023-07-05 13:46:47.379929"]]
SELECT "categories".* FROM "categories" WHERE "categories"."author_id" = $1 LIMIT $2  [["author_id", 1], ["LIMIT", 1]]