app/views/transactions/new.html.erb

        <div class="input-group">
          <%= form.collection_select :category_ids, Category.where(author_id: current_user&.id).order(:name), :id, :name, {}, { class: "form-control", multiple: true } %>
---
SELECT "categories".* FROM "categories" WHERE "categories"."author_id" = $1 ORDER BY "categories"."name" ASC  [["author_id", 1]]